valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    /* Display ON */
    lcd_write_command(0x29);
    HAL_Delay(50);   /* DÜZƏLİŞ: Display ON-dan sonra gözlə */
    
    /* Memory Write - RAM-a yazmağa hazırla */
    lcd_write_command(0x2C);
    
    /* === LCD TEST - DÜZƏLİŞ: Başlatma uğurlu olduğunu yoxla === */
    /* Qırmızı, Yaşıl, Mavi rənglərlə test et */
    ILI9341_ColorTest();
}

/* LCD rəng testi - başlatma uğurlu olduğunu yoxlamaq üçün */
void ILI9341_ColorTest(void)
{
    /* DÜZƏLİŞ: Backlight həm HIGH həm də LOW vəziyyətdə test edilir */
    /* Bəzi LCD modulları inverted backlight istifadə edir */
    
    /* Test 1: Qırmızı ekran - backlight HIGH */
    HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, GPIO_PIN_SET);
    ILI9341_FillScreen(ILI9341_COLOR_RED);
    HAL_Delay(300);
    
    /* Test 2: Yaşıl ekran */
    ILI9341_FillScreen(ILI9341_COLOR_GREEN);
    HAL_Delay(300);
    
    /* Test 3: Mavi ekran */
    ILI9341_FillScreen(ILI9341_COLOR_BLUE);
    HAL_Delay(300);
    
    /* Test 4: Ağ ekran */
    ILI9341_FillScreen(ILI9341_COLOR_WHITE);
    HAL_Delay(300);
    
    /* Test 5: Backlight LOW (inverted polarity test) */
    /* Əgər ekran bu anda yanırsa, backlight inverted-dir */
    HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, GPIO_PIN_RESET);
    ILI9341_FillScreen(ILI9341_COLOR_YELLOW);
    HAL_Delay(500);
    
    /* DÜZƏLİŞ: Backlight yenidən HIGH-a qaytar */
    /* Əgər ekran sarı (YELLOW) göstərirsə, backlight normal (HIGH aktiv) */
    /* Əgər ekran sarı göstərmirsə amma HIGH-da göstərirdisə, backlight inverted */
    HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, GPIO_PIN_SET);
    
    /* Son: Qara ekran */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
}

/* Backlight-ı invert etmək üçün funksiya */
void ILI9341_SetBacklight(uint8_t on)
{
    /* on = 1: Backlight ON, on = 0: Backlight OFF */
    /* DÜZƏLİŞ: Əgər LCD-də backlight inverted-dirsə, bu funksiyanı dəyişdirin */
    /* Normal: HIGH = ON, LOW = OFF */
    /* Inverted: HIGH = OFF, LOW = ON */
    #define BACKLIGHT_INVERTED 0  /* DÜZƏLİŞ: Əgər ekran yanmırsa, bu dəyəri 1-ə dəyişin */
    
    #if BACKLIGHT_INVERTED
        HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, on ? GPIO_PIN_RESET : GPIO_PIN_SET);
    #else
        HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, on ? GPIO_PIN_SET : GPIO_PIN_RESET);
    #endif
}

/* ------------------ Ekranı rənglə doldur ------------------ */
void ILI9341_FillScreen(uint16_t color)
{
    uint32_t px = 320UL * 240UL;

    /* RAM write (CASET/RASET landscape 320x240) */
    lcd_write_command(0x2A);  /* Column addr set */
    lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_data(0x01); lcd_write_data(0x3F); /* 319 */

    lcd_write_command(0x2B);  /* Row addr set */
    lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_data(0x00); lcd_write_data(0xEF); /* 239 */

    lcd_write_command(0x2C);  /* RAMWR */

    while (px--) {
        LCD_RAM = color;
    }
}

/* ------------------ Pixel çək ------------------ */
void ILI9341_DrawPixel(uint16_t x, uint16_t y, uint16_t color)
{
    if (x >= 320 || y >= 240) return;

    /* Set address */
    lcd_write_command(0x2A);
    lcd_write_data(x >> 8); lcd_write_data(x & 0xFF);
    lcd_write_data(x >> 8); lcd_write_data(x & 0xFF);

    lcd_write_command(0x2B);
    lcd_write_data(y >> 8); lcd_write_data(y & 0xFF);
    lcd_write_data(y >> 8); lcd_write_data(y & 0xFF);

    lcd_write_command(0x2C);
    LCD_RAM = color;
}

/* ------------------ Düzbucaqlı çək (dolu) ------------------ */
void ILI9341_DrawRectangle(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
    for (uint16_t i = 0; i < height; i++) {
        for (uint16_t j = 0; j < width; j++) {
            ILI9341_DrawPixel(x + j, y + i, color);
        }
    }
}

/* ------------------ Dolu düzbucaqlı (FillRect) ------------------ */
void ILI9341_FillRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
    /* FillRect = DrawRectangle (dolu düzbucaqlı) */
    ILI9341_DrawRectangle(x, y, width, height, color);
}

/* ------------------ Çərçivə düzbucaqlı (DrawRect) ------------------ */
void ILI9341_DrawRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
    /* Yalnız çərçivə - 4 xətt */
    /* Üst xətt */
    for (uint16_t i = 0; i < width; i++) {
        ILI9341_DrawPixel(x + i, y, color);
    }
    /* Alt xətt */
    for (uint16_t i = 0; i < width; i++) {
        ILI9341_DrawPixel(x + i, y + height - 1, color);
    }
    /* Sol xətt */
    for (uint16_t i = 0; i < height; i++) {
        ILI9341_DrawPixel(x, y + i, color);
    }
    /* Sağ xətt */
    for (uint16_t i = 0; i < height; i++) {
        ILI9341_DrawPixel(x + width - 1, y + i, color);
    }
}

/* ------------------ Xətt çək ------------------ */
void ILI9341_DrawLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color)
{
    int16_t dx = abs(x2 - x1);
    int16_t dy = abs(y2 - y1);
    int16_t sx = (x1 < x2) ? 1 : -1;
    int16_t sy = (y1 < y2) ? 1 : -1;
    int16_t err = dx - dy;

    while (1) {
        ILI9341_DrawPixel(x1, y1, color);
        if (x1 == x2 && y1 == y2) break;
        int16_t e2 = 2 * err;
        if (e2 > -dy) { err -= dy; x1 += sx; }
        if (e2 < dx) { err += dx; y1 += sy; }
    }
}

/* ------------------ Menu sistemi ------------------ */
static uint8_t current_page = 0;

typedef struct {
    uint16_t x, y, width, height;
    uint16_t color;
    char text[20];
} Button_t;

void ILI9341_DrawButton(Button_t *btn)
{
    // 3D button effect - raised appearance
    // Main button area
    ILI9341_DrawRectangle(btn->x, btn->y, btn->width, btn->height, btn->color);
    
    // Top and left edges (light)
    ILI9341_DrawLine(btn->x, btn->y, btn->x + btn->width - 1, btn->y, ILI9341_COLOR_WHITE);
    ILI9341_DrawLine(btn->x, btn->y, btn->x, btn->y + btn->height - 1, ILI9341_COLOR_WHITE);
    
    // Bottom and right edges (dark)
    ILI9341_DrawLine(btn->x, btn->y + btn->height - 1, btn->x + btn->width - 1, btn->y + btn->height - 1, ILI9341_COLOR_BLACK);
    ILI9341_DrawLine(btn->x + btn->width - 1, btn->y, btn->x + btn->width - 1, btn->y + btn->height - 1, ILI9341_COLOR_BLACK);
    
    // Inner shadow
    ILI9341_DrawRectangle(btn->x + 2, btn->y + 2, btn->width - 4, btn->height - 4, ILI9341_COLOR_BLACK);
}

