valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
uint8_t ILI9341_IsButtonPressed(Button_t *btn, uint16_t touch_x, uint16_t touch_y)
{
    return (touch_x >= btn->x && touch_x <= btn->x + btn->width &&
            touch_y >= btn->y && touch_y <= btn->y + btn->height);
}

/* Ana menu səhifəsi */
void ILI9341_ShowMainPage(void)
{
    current_page = 0;
    
    /* Qara fon */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    /* Başlıq */
    ILI9341_DrawString(100, 20, "MAIN MENU", ILI9341_COLOR_WHITE, 0x0000, 3);
    
    /* Settings düyməsi */
    Button_t settings_btn = {20, 80, 130, 40, ILI9341_COLOR_BLUE, "Settings"};
    ILI9341_DrawButton(&settings_btn);
    ILI9341_DrawString(50, 95, "SETTINGS", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Test düyməsi */
    Button_t test_btn = {170, 80, 130, 40, ILI9341_COLOR_GREEN, "Test"};
    ILI9341_DrawButton(&test_btn);
    ILI9341_DrawString(200, 95, "TEST", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Info düyməsi */
    Button_t info_btn = {20, 140, 130, 40, ILI9341_COLOR_YELLOW, "Info"};
    ILI9341_DrawButton(&info_btn);
    ILI9341_DrawString(50, 155, "INFO", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Touch test səhifəsi */
void ILI9341_ShowTouchTestPage(void)
{
    current_page = 4;
    
    /* Qara fon */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 5, 300, 20, ILI9341_COLOR_RED);
    ILI9341_DrawRectangle(12, 7, 296, 16, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(120, 12, "TOUCH TEST", ILI9341_COLOR_RED, 0xFFFF, 1);
    
    /* Təlimatlar */
    ILI9341_DrawString(10, 37, "Touch the screen", ILI9341_COLOR_WHITE, 0x0000, 1);
    ILI9341_DrawString(10, 57, "to see red dots", ILI9341_COLOR_WHITE, 0x0000, 1);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Touch handling */
void ILI9341_HandleTouch(void)
{
    uint16_t raw_x, raw_y, screen_x, screen_y;
    
    /* Touch sensor işləyirmi test et */
    if (XPT2046_IsTouched()) {
        /* Raw koordinatları oxu */
        if (XPT2046_GetCoordinates(&raw_x, &raw_y)) {
            /* Raw koordinatları ekran koordinatlarına çevir */
            XPT2046_ConvertToScreen(raw_x, raw_y, &screen_x, &screen_y);
            
            /* Touch nöqtəsini göstərmə - silindi */
            
            /* Menu navigation */
            if (current_page == 0) { // Main page
                /* Settings button */
                if (screen_x >= 20 && screen_x <= 150 && screen_y >= 80 && screen_y <= 120) {
                    current_page = 1;
                    ILI9341_ShowSettingsPage();
                }
                /* Test button - geniş koordinatlar */
                else if (screen_x >= 160 && screen_x <= 310 && screen_y >= 70 && screen_y <= 130) {
                    /* Debug: Test düyməsi basıldı - ekranın mərkəzində böyük mavi dairə */
                    for(int i = -15; i <= 15; i++) {
                        for(int j = -15; j <= 15; j++) {
                            if ((i*i + j*j) <= 225) {
                                ILI9341_DrawPixel(160 + i, 120 + j, ILI9341_COLOR_BLUE);
                            }
                        }
                    }
                    current_page = 2;
                    ILI9341_ShowTestPage();
                }
                /* Info button */
                else if (screen_x >= 20 && screen_x <= 150 && screen_y >= 140 && screen_y <= 180) {
                    current_page = 3;
                    ILI9341_ShowInfoPage();
                }
            }
            else { // Other pages
                /* Back button - bütün ekran */
                if (screen_x >= 0 && screen_x <= 319 && screen_y >= 0 && screen_y <= 239) {
                    current_page = 0;
                    ILI9341_ShowMainPage();
                }
            }
        }
        
        HAL_Delay(200); /* Debounce */
    }
}

/* Touch debug - silindi */
void ILI9341_DebugTouch(void)
{
    /* Heçnə etmə */
}

/* Touch test - silindi */
void ILI9341_TestTouch(void)
{
    /* Heçnə etmə */
}

/* Settings səhifəsi */
void ILI9341_ShowSettingsPage(void)
{
    current_page = 1;
    
    /* Yaşıl fon */
    ILI9341_FillScreen(ILI9341_COLOR_GREEN);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 10, 300, 30, ILI9341_COLOR_BLUE);
    ILI9341_DrawRectangle(12, 12, 296, 26, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(120, 20, "SETTINGS", ILI9341_COLOR_BLUE, 0xFFFF, 2);
    
    /* Məzmun */
    ILI9341_DrawString(50, 60, "LCD: 320x240", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 80, "Touch: XPT2046", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 100, "MCU: STM32F407", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 120, "Driver: ILI9341", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Test səhifəsi */
void ILI9341_ShowTestPage(void)
{
    current_page = 2;
    
    /* Qırmızı fon */
    ILI9341_FillScreen(ILI9341_COLOR_RED);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 10, 300, 30, ILI9341_COLOR_BLUE);
    ILI9341_DrawRectangle(12, 12, 296, 26, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(140, 20, "TEST", ILI9341_COLOR_BLUE, 0xFFFF, 2);
    
    /* Test məzmunu */
    ILI9341_DrawString(50, 60, "Color Test: RED", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 80, "Font Test: ABC abc 123", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 100, "Touch Test: Touch buttons", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Info səhifəsi */
void ILI9341_ShowInfoPage(void)
{
    current_page = 3;
    
