valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    /* Sarı fon */
    ILI9341_FillScreen(ILI9341_COLOR_YELLOW);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 10, 300, 30, ILI9341_COLOR_BLUE);
    ILI9341_DrawRectangle(12, 12, 296, 26, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(140, 20, "INFO", ILI9341_COLOR_BLUE, 0xFFFF, 2);
    
    /* Məlumat */
    ILI9341_DrawString(50, 60, "STM32F407ZGT6", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 80, "TFT 3.2 LCD", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 100, "ILI9341 Driver", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 120, "XPT2046 Touch", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 140, "FSMC Interface", ILI9341_COLOR_BLACK, 0x0000, 2);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* ------------------ Font funksiyaları ------------------ */
void ILI9341_DrawChar(uint16_t x, uint16_t y, char c, uint16_t color, uint16_t bgcolor, uint8_t size)
{
    if (c < 32 || c > 126) return;
    
    const uint8_t *font_data = &font_7x10.data[(c - 32) * 7];
    
    for (uint8_t i = 0; i < 7; i++) {
        uint8_t line = font_data[i];
        for (uint8_t j = 0; j < 10; j++) {
            if (line & (1 << j)) {
                // Pixel çək
                for (uint8_t sx = 0; sx < size; sx++) {
                    for (uint8_t sy = 0; sy < size; sy++) {
                        ILI9341_DrawPixel(x + i * size + sx, y + j * size + sy, color);
                    }
                }
            } else if (bgcolor != color) {
                // Background pixel çək
            for (uint8_t sx = 0; sx < size; sx++) {
                for (uint8_t sy = 0; sy < size; sy++) {
                        ILI9341_DrawPixel(x + i * size + sx, y + j * size + sy, bgcolor);
                    }
                }
            }
        }
    }
}

void ILI9341_DrawString(uint16_t x, uint16_t y, const char *str, uint16_t color, uint16_t bgcolor, uint8_t size)
{
    uint16_t start_x = x;
    while (*str) {
        if (*str == '\n') {
            y += 12 * size; // 10 + 2 space
            x = start_x;
        } else {
            ILI9341_DrawChar(x, y, *str, color, bgcolor, size);
            x += 8 * size; // 7 + 1 space
        }
        str++;
    }
}

/* ------------------ Pressure Control System ------------------ */

/* Global variables for pressure control system */
static uint8_t pressure_control_page = 0; // 0=main, 1=menu, 7=touch_cal, 8=pressure_cal, 9=pid_tune
// REMOVED: 2=pwm, 3=pressure_limit, 4=drv, 5=zme, 6=motor - PWM və PRES LIM bölmələri silindi
static float current_pressure = 0.0;
// REMOVED: float pressure_limit = 300.0; // SİLİNDİ - artıq g_system_status.target_pressure istifadə edilir
static float drv_percent = 0.0;
static float zme_percent = 0.0;
static float motor_percent = 0.0;

/* PWM control variables */
static float drv_duty_cycle = 50.0;
static float drv_frequency = 1000.0;
static float zme_duty_cycle = 50.0;
static float motor_duty_cycle = 50.0;
static float motor_frequency = 1000.0;

/* Pressure sensor calibration variables */
/* Note: These are NOT static so AdvancedPressureControl can access them */
float min_voltage = 0.5;      /* Minimum voltage (0.5V) */
float max_voltage = 5.24;     /* Maximum voltage (5.24V) */
float min_pressure = 0.0;     /* DÜZƏLİŞ: Minimum pressure (0.0 bar - sıfır təzyiq) */
float max_pressure = 300.0;   /* Maximum pressure (300.0 bar) */
uint16_t adc_min = 410;       /* ADC value at minimum pressure (0.5V) */
uint16_t adc_max = 4095;      /* KRİTİK DÜZƏLİŞ: 12-bit ADC max = 4095 (2^12 - 1), NOT 4096 */
static uint8_t calibration_mode = 0; /* 0=normal, 1=calibrate min, 2=calibrate max */

/* Ensure we never overwrite valid calibration data with defaults */
static bool ILI9341_IsPressureCalibrationValid(const CalibrationData_t* cal)
{
    if (cal == NULL || !cal->calibrated) {
        return false;
    }

    if (!isfinite(cal->adc_min) || !isfinite(cal->adc_max) ||
        !isfinite(cal->pressure_min) || !isfinite(cal->pressure_max)) {
        return false;
    }

    if (cal->adc_min < 0.0f || cal->adc_min > (float)ADC_MAX) {
        return false;
    }

    if (cal->adc_max <= cal->adc_min || cal->adc_max > (float)ADC_MAX) {
        return false;
    }

    if (cal->pressure_max <= cal->pressure_min) {
        return false;
    }

    return true;
}

/* Precise conversion constants */
// DÜZƏLİŞ: P_PER_COUNT və P_OFFSET silindi - artıq g_calibration strukturundan istifadə edilir
// Bütün təzyiq konversiyaları Advanced sistemin g_calibration strukturundan istifadə edir
static const float BAR_PER_VOLT = 66.3228f; /* bar per volt (display only) */
static const float V_PER_COUNT = 0.00158f;  /* volt per ADC count (display only) */

/* Motor/DRV/ZME conversion constants */
static const float MOTOR_BAR_PER_PERCENT = 3.144f;    /* bar per 1% motor */
static const float MOTOR_PERCENT_PER_BAR = 0.3181f;  /* % per 1 bar motor */
static const float DRV_BAR_PER_PERCENT = 10.48f;     /* bar per 1% DRV (10-40% range) */
static const float DRV_PERCENT_PER_BAR = 0.09545f;   /* % per 1 bar DRV */
static const float ZME_BAR_PER_PERCENT = 10.48f;     /* bar per 1% ZME (0-30% range) */
static const float ZME_PERCENT_PER_BAR = 0.09545f;   /* % per 1 bar ZME */

/* Pressure limits for ZME control (separate from sensor calibration) */
static float zme_min_pressure = 3.5f;   /* minimum system pressure for ZME (bar) */
static float zme_max_pressure = 200.0f;  /* maximum system pressure for ZME (bar) */
static float zme_frequency = 1000.0f;  /* ZME PWM frequency in Hz */

// Button states
static uint8_t avto_active = 0;  // REMOVED but kept for compatibility
// stop_active - REMOVED (Stop button deleted)

// Auto mode control variables - REMOVED (AutoMode deleted)

/* Helper function to draw a button with text - no borders, white background */
void ILI9341_DrawControlButton(uint16_t x, uint16_t y, uint16_t width, uint16_t height, 
                               uint16_t color, const char* text, uint8_t text_size)
{
    // Draw button background (white by default, or specified color for special states)
    ILI9341_DrawRectangle(x, y, width, height, color);
    
    // No borders - clean white buttons
    
    // Draw text centered - black text on white background
    uint16_t text_x = x + (width - strlen(text) * 8 * text_size) / 2;
    uint16_t text_y = y + (height - 10 * text_size) / 2;
    ILI9341_DrawString(text_x, text_y, text, ILI9341_COLOR_BLACK, color, text_size);
}

/* Enhanced circular pressure gauge with better visualization */
void ILI9341_DrawPressureGauge(uint16_t center_x, uint16_t center_y, uint16_t radius, float pressure, float max_pressure)
{
    // Draw outer circle with thicker border
    for (int angle = 0; angle < 360; angle++) {
        int x = center_x + radius * cos(angle * 3.14159 / 180);
        int y = center_y + radius * sin(angle * 3.14159 / 180);
        if (x >= 0 && x < 320 && y >= 0 && y < 240) {
            ILI9341_DrawPixel(x, y, ILI9341_COLOR_WHITE);
            // Draw thicker border
            if (x > 0 && x < 319 && y > 0 && y < 239) {
                ILI9341_DrawPixel(x-1, y, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x+1, y, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x, y-1, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x, y+1, ILI9341_COLOR_WHITE);
            }
        }
    }
    
    // Draw scale marks (every 30 degrees)
    for (int mark = 0; mark < 6; mark++) {
        int angle = mark * 30;
        int x1 = center_x + (radius - 2) * cos((angle + 180) * 3.14159 / 180);
        int y1 = center_y + (radius - 2) * sin((angle + 180) * 3.14159 / 180);
        int x2 = center_x + (radius - 8) * cos((angle + 180) * 3.14159 / 180);
        int y2 = center_y + (radius - 8) * sin((angle + 180) * 3.14159 / 180);
        ILI9341_DrawLine(x1, y1, x2, y2, ILI9341_COLOR_WHITE);
    }
    
    // Draw pressure arc with color coding (0-180 degrees)
    float pressure_angle = (pressure / max_pressure) * 180.0;
    for (int angle = 0; angle < pressure_angle; angle++) {
        int x = center_x + (radius - 5) * cos((angle + 180) * 3.14159 / 180);
        int y = center_y + (radius - 5) * sin((angle + 180) * 3.14159 / 180);
        if (x >= 0 && x < 320 && y >= 0 && y < 240) {
            // Enhanced color coding with more zones
            uint16_t color;
            float percentage = (float)angle / 180.0;
            if (percentage < 0.3) {
                color = ILI9341_COLOR_GREEN;      // 0-30%: Green (Safe)
            } else if (percentage < 0.6) {
                color = ILI9341_COLOR_YELLOW;     // 30-60%: Yellow (Caution)
            } else if (percentage < 0.8) {
                color = ILI9341_COLOR_ORANGE;    // 60-80%: Orange (Warning)
            } else {
                color = ILI9341_COLOR_RED;       // 80-100%: Red (Danger)
            }
            ILI9341_DrawPixel(x, y, color);
        }
    }
    
    // Draw needle (pointer) showing current pressure
    if (pressure > 0) {
        float needle_angle = (pressure / max_pressure) * 180.0 + 180.0;
        int needle_x = center_x + (radius - 3) * cos(needle_angle * 3.14159 / 180);
        int needle_y = center_y + (radius - 3) * sin(needle_angle * 3.14159 / 180);
        ILI9341_DrawLine(center_x, center_y, needle_x, needle_y, ILI9341_COLOR_RED);
    }
    
    // Draw center dot
    ILI9341_DrawRectangle(center_x - 2, center_y - 2, 5, 5, ILI9341_COLOR_RED);
}

/* Main pressure control screen */
void ILI9341_ShowPressureControlMain(void)
{
    pressure_control_page = 0;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title at top - "HIGH PRESSURE CONTROL"
    ILI9341_DrawString(40, 15, "HIGH PRESSURE CONTROL", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // Pressure gauge in center - slightly below title
    ILI9341_DrawPressureGauge(160, 80, 35, current_pressure, 300.0);
    
    // Pressure value display below gauge with enhanced formatting
    char pressure_str[25];
    if (current_pressure < 10.0) {
        sprintf(pressure_str, "%.2f BAR", current_pressure);  // 2 decimal for low values
    } else if (current_pressure < 100.0) {
        sprintf(pressure_str, "%.1f BAR", current_pressure);  // 1 decimal for medium values
    } else {
        sprintf(pressure_str, "%.0f BAR", current_pressure);   // No decimal for high values
    }
    ILI9341_DrawString(130, 125, pressure_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    
    // Show target pressure information (from Advanced system)
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    char limit_str[30];
    sprintf(limit_str, "SP: %.0f bar", status->target_pressure);
    ILI9341_DrawString(10, 140, limit_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    // Show safety status (based on target pressure)
    if (current_pressure > (status->target_pressure + 10.0f)) {
        ILI9341_DrawString(200, 140, "OVER LIMIT!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
    } else if (current_pressure > status->target_pressure) {
        ILI9341_DrawString(200, 140, "NEAR LIMIT", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    } else {
        ILI9341_DrawString(200, 140, "SAFE", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
    }
    
    // Control buttons (Menu) - below pressure display
    ILI9341_DrawControlButton(15, 150, 70, 35, ILI9341_COLOR_WHITE, "Menu", 1);
    // Auto button - REMOVED (AutoMode deleted)
    // Manual button - REMOVED (Manual mode deleted)
    // Stop button - REMOVED (Stop button deleted)
    
    /* Auto mode status display - REMOVED (AutoMode deleted) */
    
